app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `kotak_saran`
SELECT COUNT(*) AS `numrows`
FROM `kotak_saran`
WHERE `status` = 'belum_terbaca'
---
    public function admin()
    {
        // Data statistik
        $data['total_users'] = $this->userModel->countAll();
        $data['total_saran'] = $this->kotakSaranModel->countAll();
        $data['saran_belum_terbaca'] = $this->kotakSaranModel->where('status', 'belum_terbaca')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `kotak_saran`
WHERE DATE(created_at) = '2025-04-17'
---
    private function getSaranChartData($userId = null)
    {
        $data = [];
        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));

            $builder = $this->kotakSaranModel;
            if ($userId) {
                $builder->where('user_id', $userId);
            }

            $data[] = $builder->where('DATE(created_at)', $date)
                ->countAllResults();

SELECT *
FROM `kotak_saran`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `tanggapan`
ORDER BY `created_at` DESC
 LIMIT 5
---
    private function getAktivitasTerbaru($userId = null)
    {
        $aktivitas = [];

        // Ambil 5 saran terbaru
        $builder = $this->kotakSaranModel->orderBy('created_at', 'DESC');
        if ($userId) {
            $builder->where('user_id', $userId);
        }
        $saran = $builder->findAll(5);

        foreach ($saran as $s) {
            $aktivitas[] = [
                 'deskripsi' => 'Mengirim saran: ' . substr($s->isi_saran, 0, 50) . '...',
                 'waktu' => date('d M H:i', strtotime($s->created_at))
            ];
        }

        // Ambil 5 tanggapan terbaru
        $builder = $this->tanggapanModel->orderBy('created_at', 'DESC');
        if ($userId) {
            $builder->where('user_id', $userId);
        }
        $tanggapan = $builder->findAll(5);