app/Controllers/KotakSaranController.php

    public function updateStatus($id)
    {
        // Cek apakah saran ada
        $saran = $this->kotakSaranModel->find($id);
        if (!$saran) {
            throw new PageNotFoundException('Saran tidak ditemukan');
        }

        try {
            $this->kotakSaranModel->update($id, [
                'status' => 'terbaca'
            ]);
---
UPDATE `kotak_saran` SET `status` = 'terbaca', `updated_at` = '2025-04-23 08:26:47'
WHERE `kotak_saran`.`id` IN ('6')