app/Controllers/UserController.php

    public function index()
    {
        $data = [
            'title' => 'Manajemen User',
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`