app/Models/KotakSaranModel.php

SELECT COUNT(*) AS `numrows`
FROM `kotak_saran`
LEFT JOIN `tanggapan` ON `kotak_saran`.`id` = `tanggapan`.`saran_id`
WHERE `tanggapan`.`id` IS NULL
---
    public function getSaranTanpaTanggapan()
    {
        return $this->db->table('kotak_saran')
            ->select('kotak_saran.*')
            ->join('tanggapan', 'kotak_saran.id = tanggapan.saran_id', 'left')
            ->where('tanggapan.id IS NULL')
            ->countAllResults();

SELECT `kotak_saran`.*, `users`.`username`
FROM `kotak_saran`
JOIN `users` ON `users`.`id` = `kotak_saran`.`user_id`
ORDER BY `kotak_saran`.`created_at` DESC
---
    public function getAllSaran()
    {
        return $this->select('kotak_saran.*, users.username')
            ->join('users', 'users.id = kotak_saran.user_id')
            ->orderBy('kotak_saran.created_at', 'DESC')
            ->findAll();